In [70]:
import pandas as pd

In [71]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [72]:
selloutData.head(2)

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0

### A01지역의 2015년도 제품별 평균판매량이 가장 높은 상품 3개는? (콤마로 구분하여 작성, 예: PRODUCT12,PRODUCT2,PRODUCT3)

In [73]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [74]:
selloutData["REGIONID"] = selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"] = selloutData["PRODUCT"].astype(str)
selloutData["YEARWEEK"] = selloutData["YEARWEEK"].astype(str)

In [75]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

In [76]:
selloutData["YEAR"] = selloutData.YEARWEEK.str[:4]
selloutData["WEEK"] = selloutData.YEARWEEK.str[4:6]
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
YEAR         object
WEEK         object
dtype: object

In [30]:
refinedSelloutData = selloutData.loc[ selloutData.YEAR.astype(int) == 2015 ]

In [32]:
refinedSelloutData.head()

   REGIONID    PRODUCT YEARWEEK   QTY  YEAR WEEK
27      A00  PRODUCT34   201520  62.0  2015   20
30      A00  PRODUCT34   201517  49.0  2015   17
32      A00  PRODUCT34   201512  55.0  2015   12
37      A00  PRODUCT34   201519  39.0  2015   19
38      A00  PRODUCT34   201507  60.0  2015   07

In [34]:
sortKey = ["REGIONID","PRODUCT","YEARWEEK"]

In [35]:
sortedData = refinedSelloutData.sort_values(by=sortKey)

In [36]:
sortedData.head()

   REGIONID    PRODUCT YEARWEEK    QTY  YEAR WEEK
53      A00  PRODUCT34   201501  151.0  2015   01
47      A00  PRODUCT34   201502  191.0  2015   02
68      A00  PRODUCT34   201503  107.0  2015   03
40      A00  PRODUCT34   201504  154.0  2015   04
96      A00  PRODUCT34   201505   69.0  2015   05

In [48]:
groupKey = ["REGIONID","PRODUCT","YEAR"]

In [49]:
groupData = sortedData.groupby(groupKey, as_index=False).QTY.mean()

In [50]:
groupData = groupData.rename(columns = {'QTY': 'QTY_MEAN'})

In [62]:
a01groupData = groupData.loc[groupData.REGIONID == 'A01']
a01groupData.head()

  REGIONID    PRODUCT  YEAR       QTY_MEAN
3      A01   PRODUCT1  2015    6383.811321
4      A01  PRODUCT12  2015  196178.811321
5      A01  PRODUCT14  2015   18725.924528
6      A01  PRODUCT15  2015    4841.132075
7      A01  PRODUCT16  2015    1443.471698

In [65]:
a01groupData.sort_values(by=["QTY_MEAN"], ascending=False).head()

   REGIONID    PRODUCT  YEAR       QTY_MEAN
18      A01  PRODUCT59  2015  653210.547170
4       A01  PRODUCT12  2015  196178.811321
12      A01  PRODUCT34  2015  111175.830189
22      A01  PRODUCT63  2015   47621.811321
24      A01  PRODUCT75  2015   30511.981132

### 2. 2015년도 A01 지역에서 생산한 제품의 종류는 몇종인가요?

In [69]:
a01groupData.sort_values(by=["PRODUCT"], ascending=True).describe

<bound method NDFrame.describe of    REGIONID    PRODUCT  YEAR       QTY_MEAN
3       A01   PRODUCT1  2015    6383.811321
4       A01  PRODUCT12  2015  196178.811321
5       A01  PRODUCT14  2015   18725.924528
6       A01  PRODUCT15  2015    4841.132075
7       A01  PRODUCT16  2015    1443.471698
8       A01  PRODUCT19  2015    3566.377358
9       A01   PRODUCT2  2015   19514.000000
10      A01  PRODUCT20  2015      63.867925
11      A01  PRODUCT33  2015   11246.754717
12      A01  PRODUCT34  2015  111175.830189
13      A01   PRODUCT4  2015   25407.830189
14      A01  PRODUCT47  2015   10657.000000
15      A01  PRODUCT56  2015    5867.716981
16      A01  PRODUCT57  2015    6615.509434
17      A01  PRODUCT58  2015   17369.962264
18      A01  PRODUCT59  2015  653210.547170
19      A01   PRODUCT6  2015     200.981132
20      A01  PRODUCT60  2015       0.000000
21      A01  PRODUCT62  2015   12765.320755
22      A01  PRODUCT63  2015   47621.811321
23      A01   PRODUCT7  2015    1772.226415
24      A01  PRODUCT75  2015   30511.981132
25      A01   PRODUCT8  2015     187.943396>

### 3. 2015년도 1사분기 (1~13주) 평균 판매량이 가장 높은 지역 5개를 순서대로 적어주세요 (예: A01, A02,A03,A04,A05), 띄어쓰기 없이 다 붙여서!!

In [93]:
refinedSelloutData = selloutData.loc[selloutData.YEAR.astype(int) == 2015]

In [96]:
newSelloutData = refinedSelloutData.loc[refinedSelloutData.WEEK.astype(int) <= 13]

In [98]:
newSelloutData.head()

      REGIONID    PRODUCT YEARWEEK       QTY  YEAR WEEK
22005      A47   PRODUCT2   201512       2.0  2015   12
22006      A47  PRODUCT58   201512    3546.0  2015   12
22007      A47  PRODUCT59   201512  148781.0  2015   12
22008      A47  PRODUCT34   201512   29332.0  2015   12
22009      A48  PRODUCT35   201512    4611.0  2015   12

In [100]:
groupKey = ["REGIONID"]

In [101]:
groupData = newSelloutData.groupby(groupKey)["QTY"].agg("mean").reset_index()

In [103]:
groupData.sort_values(by=["QTY"], ascending=False).head()

   REGIONID            QTY
40      A41  154823.096154
46      A47   52446.076923
1       A01   40121.414716
29      A29   29359.717949
27      A27   28716.201923

In [42]:
groupKey = ["REGIONID"]

In [43]:
groupData = sortedData.groupby(groupKey)["QTY"].agg("mean").reset_index()

In [44]:
groupData.rename({"QTY":"QTY_NEW"}, inplace=True)

In [45]:
groupData.sort_values("QTY", ascending=False) # 얼마만 welloutData

   REGIONID            QTY
40      A41  128093.018868
46      A47   60662.382075
1       A01   51536.035275
20      A20   34052.993711
29      A29   33255.371069
..      ...            ...
63      A65    1262.391872
35      A36    1222.905660
42      A43    1124.885535
38      A39    1098.463177
57      A59     881.343396

[70 rows x 2 columns]